import { observable, action } from "mobx"
import { BaseStore, getOrCreateStore } from "next-mobx-wrapper"

class Store extends BaseStore {
  @observable menu = [
    {
      href: "/",
      context: "首页"
    },
    {
      href: "/archives",
      context: "归档"
    },
    {
      href: "/search",
      context: "搜索"
    },
    {
      href: "/about",
      context: "关于"
    }
  ]

  @observable articleList = []

  @observable articles = [
    {
      id: 1,
      title: "我们失去的其实从未拥有过。",
      time: "2019-10-10 10:10"
    },
    {
      id: 1,
      title: "我们失去的其实从未拥有过。",
      time: "2019-10-10 10:10"
    },
    {
      id: 1,
      title: "我们失去的其实从未拥有过。",
      time: "2019-10-10 10:10"
    },
    {
      id: 1,
      title: "我们失去的其实从未拥有过。",
      time: "2019-10-10 10:10"
    },
    {
      id: 1,
      title: "我们失去的其实从未拥有过。",
      time: "2019-10-10 10:10"
    },
    {
      id: 1,
      title: "我们失去的其实从未拥有过。",
      time: "2019-10-10 10:10"
    },
    {
      id: 1,
      title: "我们失去的其实从未拥有过。",
      time: "2019-10-10 10:10"
    },
    {
      id: 1,
      title: "我们失去的其实从未拥有过。",
      time: "2019-10-10 10:10"
    },
    {
      id: 1,
      title: "我们失去的其实从未拥有过。",
      time: "2019-10-10 10:10"
    },
    {
      id: 1,
      title: "我们失去的其实从未拥有过。",
      time: "2019-10-10 10:10"
    },
    {
      id: 1,
      title: "我们失去的其实从未拥有过。",
      time: "2019-10-10 10:10"
    },
    {
      id: 1,
      title: "我们失去的其实从未拥有过。",
      time: "2019-10-10 10:10"
    },
    {
      id: 1,
      title:
        "害，你在逗我呢，害，你在逗我呢，害，你在逗我呢，害，你在逗我呢，害，你在逗我呢，害，你在逗我呢，害，你在逗我呢，害，你在逗我呢，演示说明",
      time: "2019-10-10 10:10"
    },
    {
      id: 1,
      title:
        "害，你在逗我呢，害，你在逗我呢，害，你在逗我呢，害，你在逗我呢，害，你在逗我呢，害，你在逗我呢，害，你在逗我呢，害，你在逗我呢，演示说明",
      time: "2019-10-10 10:10"
    },
    {
      id: 1,
      title:
        "害，你在逗我呢，害，你在逗我呢，害，你在逗我呢，害，你在逗我呢，害，你在逗我呢，害，你在逗我呢，害，你在逗我呢，害，你在逗我呢，演示说明",
      time: "2019-10-10 10:10"
    },
    {
      id: 1,
      title:
        "害，你在逗我呢，害，你在逗我呢，害，你在逗我呢，害，你在逗我呢，害，你在逗我呢，害，你在逗我呢，害，你在逗我呢，害，你在逗我呢，演示说明",
      time: "2019-10-10 10:10"
    },
    {
      id: 1,
      title:
        "害，你在逗我呢，害，你在逗我呢，害，你在逗我呢，害，你在逗我呢，害，你在逗我呢，害，你在逗我呢，害，你在逗我呢，害，你在逗我呢，演示说明",
      time: "2019-10-10 10:10"
    },
    {
      id: 1,
      title:
        "害，你在逗我呢，害，你在逗我呢，害，你在逗我呢，害，你在逗我呢，害，你在逗我呢，害，你在逗我呢，害，你在逗我呢，害，你在逗我呢，演示说明",
      time: "2019-10-10 10:10"
    },
    {
      id: 1,
      title:
        "害，你在逗我呢，害，你在逗我呢，害，你在逗我呢，害，你在逗我呢，害，你在逗我呢，害，你在逗我呢，害，你在逗我呢，害，你在逗我呢，演示说明",
      time: "2019-10-10 10:10"
    },
    {
      id: 1,
      title:
        "害，你在逗我呢，害，你在逗我呢，害，你在逗我呢，害，你在逗我呢，害，你在逗我呢，害，你在逗我呢，害，你在逗我呢，害，你在逗我呢，演示说明",
      time: "2019-10-10 10:10"
    },
    {
      id: 1,
      title:
        "害，你在逗我呢，害，你在逗我呢，害，你在逗我呢，害，你在逗我呢，害，你在逗我呢，害，你在逗我呢，害，你在逗我呢，害，你在逗我呢，演示说明",
      time: "2019-10-10 10:10"
    },
    {
      id: 1,
      title:
        "害，你在逗我呢，害，你在逗我呢，害，你在逗我呢，害，你在逗我呢，害，你在逗我呢，害，你在逗我呢，害，你在逗我呢，害，你在逗我呢，演示说明",
      time: "2019-10-10 10:10"
    },
    {
      id: 1,
      title:
        "害，你在逗我呢，害，你在逗我呢，害，你在逗我呢，害，你在逗我呢，害，你在逗我呢，害，你在逗我呢，害，你在逗我呢，害，你在逗我呢，演示说明",
      time: "2019-10-10 10:10"
    },
    {
      id: 1,
      title:
        "害，你在逗我呢，害，你在逗我呢，害，你在逗我呢，害，你在逗我呢，害，你在逗我呢，害，你在逗我呢，害，你在逗我呢，害，你在逗我呢，演示说明",
      time: "2019-10-10 10:10"
    },
    {
      id: 1,
      title:
        "害，你在逗我呢，害，你在逗我呢，害，你在逗我呢，害，你在逗我呢，害，你在逗我呢，害，你在逗我呢，害，你在逗我呢，害，你在逗我呢，演示说明",
      time: "2019-10-10 10:10"
    },
    {
      id: 1,
      title:
        "害，你在逗我呢，害，你在逗我呢，害，你在逗我呢，害，你在逗我呢，害，你在逗我呢，害，你在逗我呢，害，你在逗我呢，害，你在逗我呢，演示说明",
      time: "2019-10-10 10:10"
    },
    {
      id: 1,
      title:
        "害，你在逗我呢，害，你在逗我呢，害，你在逗我呢，害，你在逗我呢，害，你在逗我呢，害，你在逗我呢，害，你在逗我呢，害，你在逗我呢，演示说明",
      time: "2019-10-10 10:10"
    },
    {
      id: 1,
      title:
        "害，你在逗我呢，害，你在逗我呢，害，你在逗我呢，害，你在逗我呢，害，你在逗我呢，害，你在逗我呢，害，你在逗我呢，害，你在逗我呢，演示说明",
      time: "2019-10-10 10:10"
    },
    {
      id: 1,
      title:
        "害，你在逗我呢，害，你在逗我呢，害，你在逗我呢，害，你在逗我呢，害，你在逗我呢，害，你在逗我呢，害，你在逗我呢，害，你在逗我呢，演示说明",
      time: "2019-10-10 10:10"
    },
    {
      id: 1,
      title:
        "害，你在逗我呢，害，你在逗我呢，害，你在逗我呢，害，你在逗我呢，害，你在逗我呢，害，你在逗我呢，害，你在逗我呢，害，你在逗我呢，演示说明",
      time: "2019-10-10 10:10"
    },
    {
      id: 1,
      title:
        "害，你在逗我呢，害，你在逗我呢，害，你在逗我呢，害，你在逗我呢，害，你在逗我呢，害，你在逗我呢，害，你在逗我呢，害，你在逗我呢，演示说明",
      time: "2019-10-10 10:10"
    },
    {
      id: 1,
      title:
        "害，你在逗我呢，害，你在逗我呢，害，你在逗我呢，害，你在逗我呢，害，你在逗我呢，害，你在逗我呢，害，你在逗我呢，害，你在逗我呢，演示说明",
      time: "2019-10-10 10:10"
    },
    {
      id: 1,
      title:
        "害，你在逗我呢，害，你在逗我呢，害，你在逗我呢，害，你在逗我呢，害，你在逗我呢，害，你在逗我呢，害，你在逗我呢，害，你在逗我呢，演示说明",
      time: "2019-10-10 10:10"
    },
    {
      id: 1,
      title:
        "害，你在逗我呢，害，你在逗我呢，害，你在逗我呢，害，你在逗我呢，害，你在逗我呢，害，你在逗我呢，害，你在逗我呢，害，你在逗我呢，演示说明",
      time: "2019-10-10 10:10"
    }
  ]

  @action getArticleList(page = 1) {
    let article = (this.articles || []).slice(),
      result = []
    for (let i = 0; i < article.length; i += 10) {
      result.push(article.slice(i, i + 10))
    }
    if (result[page - 1]) {
      this.articleList = result[page - 1]
    } else {
      this.articleList = []
    }
  }
}

export const getMainStore = getOrCreateStore("mainStore", Store)
